# Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.

# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

import random as rnd
#from random import randint

# Test
a = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
print(a)
b = [n for i, n in enumerate(a) if i > 0 and a[i] > a[i - 1]]
print(b)
# ----------------------------------------------------------------------------------------------------------------------
# Random list
a2 = [rnd.randint(-10, 10) for i in range(20)]
print(a2)
b2 = [n for i, n in enumerate(a2) if i > 0 and a2[i] > a2[i - 1]]
print(b2)
